weifengdq/embedded/tc364/0_Board_Test_CAN_x8/Libraries/Infra/Sfr/TC36x/IfxEvadc_bf.h
/** \brief Mask for Ifx_EVADC_FC_FCBFL_Bits.BFM */
#define IFX_EVADC_FC_FCBFL_BFM_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_FC_FCBFL_Bits.BFM */
#define IFX_EVADC_FC_FCBFL_BFM_OFF (16u)

/** \brief Length for Ifx_EVADC_FC_FCBFL_Bits.BFV */
#define IFX_EVADC_FC_FCBFL_BFV_LEN (1u)

/** \brief Mask for Ifx_EVADC_FC_FCBFL_Bits.BFV */
#define IFX_EVADC_FC_FCBFL_BFV_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_FC_FCBFL_Bits.BFV */
#define IFX_EVADC_FC_FCBFL_BFV_OFF (17u)

/** \brief Length for Ifx_EVADC_FC_FCBFL_Bits.BFLNP */
#define IFX_EVADC_FC_FCBFL_BFLNP_LEN (4u)

/** \brief Mask for Ifx_EVADC_FC_FCBFL_Bits.BFLNP */
#define IFX_EVADC_FC_FCBFL_BFLNP_MSK (0xfu)

/** \brief Offset for Ifx_EVADC_FC_FCBFL_Bits.BFLNP */
#define IFX_EVADC_FC_FCBFL_BFLNP_OFF (24u)

/** \brief Length for Ifx_EVADC_FC_FCBFL_Bits.FCR */
#define IFX_EVADC_FC_FCBFL_FCR_LEN (1u)

/** \brief Mask for Ifx_EVADC_FC_FCBFL_Bits.FCR */
#define IFX_EVADC_FC_FCBFL_FCR_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_FC_FCBFL_Bits.FCR */
#define IFX_EVADC_FC_FCBFL_FCR_OFF (28u)

/** \brief Length for Ifx_EVADC_FC_FCBFL_Bits.VF */
#define IFX_EVADC_FC_FCBFL_VF_LEN (1u)

/** \brief Mask for Ifx_EVADC_FC_FCBFL_Bits.VF */
#define IFX_EVADC_FC_FCBFL_VF_MSK (0x1u)

/** \brief Offset for Ifx_EVADC_FC_FCBFL_Bits.VF */
#define IFX_EVADC_FC_FCBFL_VF_OFF (31u)

/** \brief Length for Ifx_EVADC_FC_FCHYST_Bits.DELTAMINUS */
#define IFX_EVADC_FC_FCHYST_DELTAMINUS_LEN (10u)

/** \brief Mask for Ifx_EVADC_FC_FCHYST_Bits.DELTAMINUS */
#define IFX_EVADC_FC_FCHYST_DELTAMINUS_MSK (0x3ffu)

/** \brief Offset for Ifx_EVADC_FC_FCHYST_Bits.DELTAMINUS */
#define IFX_EVADC_FC_FCHYST_DELTAMINUS_OFF (2u)

/** \brief Length for Ifx_EVADC_FC_FCHYST_Bits.DELTAPLUS */
#define IFX_EVADC_FC_FCHYST_DELTAPLUS_LEN (10u)

/** \brief Mask for Ifx_EVADC_FC_FCHYST_Bits.DELTAPLUS */
#define IFX_EVADC_FC_FCHYST_DELTAPLUS_MSK (0x3ffu)

/** \brief Offset for Ifx_EVADC_FC_FCHYST_Bits.DELTAPLUS */
#define IFX_EVADC_FC_FCHYST_DELTAPLUS_OFF (18u)

/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXEVADC_BF_H */
